{"file_name": "imgs/259_frontal.jpg", "text": "This two-story house features a three-car garage, a covered front porch, and a well-maintained lawn, creating an inviting exterior."}
{"file_name": "imgs/259_frontal.jpg", "text": "The facade features beige stucco with white trim, stone accent pillars, and a reddish-brown shingle roof; includes light fixtures by the garage and front door."}
{"file_name": "imgs/259_frontal.jpg", "text": "This house features a contemporary suburban architectural style with a stucco exterior, gabled roofs, and a mix of stone accents on the front porch columns."}
{"file_name": "imgs/259_frontal.jpg", "text": "Modern two-story home with a charming porch, spacious dual garages, stucco exterior, tiled roof, and manicured lawn. Highlights include layered roofline, prominent eaves, and inviting outdoor veranda."}
{"file_name": "imgs/15_frontal.jpg", "text": "Southwestern-style home with brick facade, pitched roof, and arched entry. Features xeriscaped garden, American flagpole, and ambient night lighting, creating a serene desert oasis."}
{"file_name": "imgs/15_frontal.jpg", "text": "The house showcases a blend of Southwestern and contemporary style, featuring stucco walls, arched windows, a tile roof, and desert landscaping."}
{"file_name": "imgs/15_frontal.jpg", "text": "The facade features varied brickwork, earthy beige tones, and smooth textures. Decorative arched windows, illuminated landscaping, and a prominent flagpole add charm and detail."}
{"file_name": "imgs/15_frontal.jpg", "text": "A single-story house with a partial stone facade, a prominent entryway, and a landscaped front yard featuring a U.S. flagpole and various desert plants."}
{"file_name": "imgs/172_frontal.jpg", "text": "Single-story ranch-style home with a mix of brick and wood siding, featuring a sloped roof, large windows, and a landscaped garden."}
{"file_name": "imgs/172_frontal.jpg", "text": "This charming ranch-style home features a brick facade, spacious layout, landscaped garden, multi-tiered entry, and a concrete driveway, exuding classic appeal and modern comfort."}
{"file_name": "imgs/172_frontal.jpg", "text": "Single-story house with brick facade, featuring a covered porch and landscaped garden area, leading to an entryway with multiple front steps."}
{"file_name": "imgs/172_frontal.jpg", "text": "The facade features red and white brick, beige vertical siding, dark green trim, and a tiled roof. Decorative plants and potted flowers adorn the brick staircase entry."}
{"file_name": "imgs/422_frontal.jpg", "text": "Charming ranch-style home with a spacious layout, featuring a three-car garage, manicured lawn, mountain views, and a welcoming porch, offering serene outdoor living and unique character."}
{"file_name": "imgs/422_frontal.jpg", "text": "The house showcases a modern suburban architectural style with its clean lines, gable roof, attached garage, and neat landscaping, blending contemporary and traditional elements."}
{"file_name": "imgs/422_frontal.jpg", "text": "The facade features white siding, gray roof tiles, stone accents, and a covered porch. Subtle decorative elements include window shutters and external lighting fixtures by the entrance."}
{"file_name": "imgs/422_frontal.jpg", "text": "This single-story home features a multi-car garage, a covered front porch, and a well-manicured lawn, all set against a scenic mountainous backdrop."}
{"file_name": "imgs/229_frontal.jpg", "text": "The house features two stories, an attached garage, a covered entry porch, and well-manicured landscaping with stairs leading to the front door."}
{"file_name": "imgs/229_frontal.jpg", "text": "The facade features beige stucco, brown shutters, stone accents, and beige trim. Decorative elements include a wreath and exterior wall light fixtures."}
{"file_name": "imgs/229_frontal.jpg", "text": "The house combines elements of Craftsman and Contemporary styles, featuring stucco walls, shutters, a symmetrical facade, multi-gable rooflines, and stone accents."}
{"file_name": "imgs/229_frontal.jpg", "text": "Charming two-story Craftsman home with gable roofs, stone accents, spacious lawn, welcoming front porch, and brick-paver steps. Features open-plan design and elegant shutters, blending comfort with curb appeal."}
{"file_name": "imgs/65_frontal.jpg", "text": "This two-story brick home features a gabled roof, triple garage, large arched windows, manicured lawn, and mature trees, exemplifying classic American suburban architecture with elegant, roomy, light-filled interiors."}
{"file_name": "imgs/65_frontal.jpg", "text": "The house is designed in a modern suburban style with a brick exterior, multi-gabled roof, large windows, and an attached three-car garage."}
{"file_name": "imgs/65_frontal.jpg", "text": "The house exterior features red brick with gray roof shingles, white window trim, an arched window pattern, and matching white garage doors. Decorative lighting fixtures flank the entrance."}
{"file_name": "imgs/65_frontal.jpg", "text": "This two-story brick house features large arched windows, a three-car garage, and a prominent front door, with an attractive gable roof design and well-maintained landscaping."}
{"file_name": "imgs/530_frontal.jpg", "text": "Stucco facade in neutral tan, white trim, and brown shutters. Tiled roof, small decorative vents, two hanging lantern-style fixtures, greenery accents at base."}
{"file_name": "imgs/530_frontal.jpg", "text": "A single-story house featuring a gabled roof, decorative shutters, and a two-car garage. It includes a small garden area, and a driveway. The exterior is stuccoed."}
{"file_name": "imgs/530_frontal.jpg", "text": "Charming ranch-style home with stucco exterior, two-car garage, well-manicured lawn, tiled roof, and elegant landscaping. Unique blend of suburban tranquility and modern amenities."}
{"file_name": "imgs/530_frontal.jpg", "text": "The house features a California Ranch style characterized by stucco walls, gable roofs with exposed beams, large garage door, and an open, single-story layout."}
{"file_name": "imgs/98_frontal.jpg", "text": "A charming multi-story home featuring suburban architectural style, spacious layout, manicured landscaping, and a distinctively inviting exterior with large windows and a tiled roof."}
{"file_name": "imgs/98_frontal.jpg", "text": "The house features a contemporary suburban architectural style with a gabled roof, large windows, and light-colored siding, exuding a clean and modern aesthetic."}
{"file_name": "imgs/98_frontal.jpg", "text": "The facade features light gray horizontal siding, terracotta roof tiles, white trim, a central pillar, a paneled garage door, large windows, minimal decor, and a single sconce light fixture."}
{"file_name": "imgs/98_frontal.jpg", "text": "This is a two-story house with a tiled roof, prominent front gable, large windows, and an attached garage, featuring a clean, charming exterior."}
{"file_name": "imgs/102_frontal.jpg", "text": "The house features a Mediterranean architectural style, characterized by white stucco walls, red-tiled roofs, and a spacious terrace with balustrades."}
{"file_name": "imgs/102_frontal.jpg", "text": "This elegant hillside home features Mediterranean architectural style, multi-level layout, expansive balconies, panoramic views, spacious driveway, and unique stone landscaping for a luxurious and serene retreat."}
{"file_name": "imgs/102_frontal.jpg", "text": "A two-story house featuring a prominent garage, multiple terraces, and defined balconies, enhancing its architectural appeal and exterior functionality."}
{"file_name": "imgs/102_frontal.jpg", "text": "The facade features white stucco walls, red tile roofing, and beige decorative balustrades. There are exterior sconces and patterned railings enhancing the visual appeal."}
{"file_name": "imgs/452_frontal.jpg", "text": "Charming single-story ranch-style home with a tiled roof, manicured hedges, gated front yard, and scenic mountain backdrop, offering serene natural views and privacy."}
{"file_name": "imgs/452_frontal.jpg", "text": "Single-story, ranch-style home with a gable roof, minimalist design, and a manicured front yard."}
{"file_name": "imgs/452_frontal.jpg", "text": "The facade features light-colored walls, a grey-tiled roof, and minimalistic metal fencing. Decorative elements include neatly trimmed bushes, but no visible lighting fixtures or elaborate patterns."}
{"file_name": "imgs/452_frontal.jpg", "text": "The house is single-story with a tiled roof. It features a front yard with landscaped shrubs and a boundary fence for privacy. There are no visible balconies or terraces."}
{"file_name": "imgs/315_frontal.jpg", "text": "This modern, single-story home features a stucco exterior, tile roof, spacious backyard, and large windows. Its minimalist landscape and serene surroundings provide a tranquil living space."}
{"file_name": "imgs/315_frontal.jpg", "text": "The house features a modern, single-story design with a sloped tile roof, stucco exterior, and simple landscaping."}
{"file_name": "imgs/315_frontal.jpg", "text": "The facade features beige stucco, white-framed windows, and a gray-tiled roof. Vegetation frames the structure, with no visible decorative elements or lighting fixtures."}
{"file_name": "imgs/315_frontal.jpg", "text": "The house is a single-story structure with a gable roof, large white-framed windows, and a well-maintained garden; no balconies, terraces, or verandas visible."}
{"file_name": "imgs/277_frontal.jpg", "text": "Beige stucco and white siding facade with dark grey roof shingles, narrow white-framed windows, and small decorative black wall-mounted light fixtures flanking the garage doors. Simple, neat landscaping."}
{"file_name": "imgs/277_frontal.jpg", "text": "Single-story house with three garage doors, gabled roof, and a small front verandah. Features include a manicured lawn and a welcoming entryway framed by white pillars."}
{"file_name": "imgs/277_frontal.jpg", "text": "Charming modern ranch-style home featuring three-car garage, spacious driveway, inviting front garden, peaked rooflines, and a welcoming entrance with arch details. Ideal blend of elegance and practicality."}
{"file_name": "imgs/277_frontal.jpg", "text": "Modern Ranch: Low-pitched roof, wide overhanging eaves, large front-facing garage, horizontal siding, and simple, clean lines characterize this suburban family home style."}
{"file_name": "imgs/365_frontal.jpg", "text": "This cozy modern manufactured home features a simple, open structure with a gravel front yard, covered carport, inviting porch, and minimalistic landscaping, ideal for low-maintenance living."}
{"file_name": "imgs/365_frontal.jpg", "text": "The house features a simple, utilitarian style, characterized by its modest design, flat-brown exterior, small front porch, and a carport with lattice support."}
{"file_name": "imgs/365_frontal.jpg", "text": "The exterior features beige siding with white trim, brown wooden steps, lattice carport, gravel yard, and decorative potted plants. No visible lighting fixtures."}
{"file_name": "imgs/365_frontal.jpg", "text": "Single-story house with a front porch. Features a carport with latticework and a low-maintenance gravel yard. Simple, rectangular design with modest, practical architectural elements."}
{"file_name": "imgs/481_frontal.jpg", "text": "Single-story ranch-style house with a gabled roof, attached garage, and simple façade. Features a front porch with wooden railings and large windows, typical of suburban American homes."}
{"file_name": "imgs/481_frontal.jpg", "text": "Charming single-story ranch, featuring a pitched roof, front porch, spacious driveway, and attached garage. Highlighted by a mature tree, fenced yard, and quiet suburban setting for serene living."}
{"file_name": "imgs/481_frontal.jpg", "text": "Single-story house with a modern design, featuring a front porch and a two-car garage. Well-maintained yard with a central tree adds charm and privacy."}
{"file_name": "imgs/481_frontal.jpg", "text": "The facade features neutral-colored stucco, black window trim, a brown shingled roof, and wooden posts. Decorative elements include barrel planters and outdoor wall lights near the garage."}
{"file_name": "imgs/398_frontal.jpg", "text": "This minimalist, single-story home features desert landscaping, a flat roof, large windows, and a single-car garage, embodying mid-century modern architecture with a drought-tolerant garden."}
{"file_name": "imgs/398_frontal.jpg", "text": "The house features a simple, minimalist design, typical of mid-20th-century ranch-style architecture with clean lines, a flat roof, and a single-story structure. Desert landscaping complements the look."}
{"file_name": "imgs/398_frontal.jpg", "text": "The facade features light-colored siding, horizontal lines, large windows, and a white garage door. The landscape includes gravel, rocks, and desert plants. There are no visible decorative elements or lighting fixtures."}
{"file_name": "imgs/398_frontal.jpg", "text": "This is a single-story house with a minimalist design, featuring a front yard with desert landscaping, a single-car garage, and large front windows."}
{"file_name": "imgs/207_frontal.jpg", "text": "The facade features purple siding, white trim, decorative woodwork, and patterned gable accents. White picket fence and floral arbor enhance the exterior. Minimalist lighting fixtures are incorporated."}
{"file_name": "imgs/207_frontal.jpg", "text": "A two-story house with a decorative gable, intricate trim, a covered front entrance, and a small garden with a white picket fence."}
{"file_name": "imgs/207_frontal.jpg", "text": "Victorian-style home with ornate detailing, compact structure, front porch trellis, and white picket fence. Its unique lavender exterior and intricate trim make it stand out in the neighborhood."}
{"file_name": "imgs/207_frontal.jpg", "text": "The house exhibits the Victorian architectural style with intricate woodwork, gable roof, decorative trims, and pastel color palette, reflecting 19th-century design elements."}
{"file_name": "imgs/384_frontal.jpg", "text": "This single-story, modern home features an open layout with large windows, a carport, and landscaping with palm trees. Unique for its simple design and ample outdoor space."}
{"file_name": "imgs/384_frontal.jpg", "text": "The house showcases a mid-century modern style, featuring a flat roof, large windows, and clean lines typical of the era. The palm trees add a distinctive touch."}
{"file_name": "imgs/384_frontal.jpg", "text": "The facade features beige siding with brown trim, large windows, and a small garden bed. Notable elements include tall palm trees and a black lantern-style light fixture."}
{"file_name": "imgs/384_frontal.jpg", "text": "The house is a single-story structure featuring large windows, a carport, and a small front garden with palm trees. It includes a paved driveway and a side gate."}
{"file_name": "imgs/502_frontal.jpg", "text": "A two-story house featuring a pitched roof and clean stucco exterior. The design includes large windows and minimalistic detailing, with no visible balconies, terraces, or verandas."}
{"file_name": "imgs/502_frontal.jpg", "text": "The facade features beige stucco with tan vertical siding accents. White trim around windows and corners. Brown roof shingles. Minimalistic design with no visible decorative elements or lighting fixtures."}
{"file_name": "imgs/502_frontal.jpg", "text": "The house exhibits a contemporary suburban architectural style with clean lines, neutral stucco exterior, and a gabled roof, typical of modern residential developments."}
{"file_name": "imgs/502_frontal.jpg", "text": "This two-story contemporary home features a stucco exterior, landscaped front yard, and a shared driveway. Its clean lines, neutral tones, and strategic windows enhance natural light."}
{"file_name": "imgs/57_frontal.jpg", "text": "The house exhibits a ranch-style architectural design with a low-pitch roof, stucco exterior, and a single-story layout. Minimal ornamentation highlights simplicity and functionality."}
{"file_name": "imgs/57_frontal.jpg", "text": "Charming single-story ranch home featuring stucco exterior, spacious open floor plan, front patio, large windows, pitched roof, and fenced yard in a serene neighborhood."}
{"file_name": "imgs/57_frontal.jpg", "text": "This single-story house features a front porch and minimalistic design with several large windows. It has a fenced entrance and a simple gable roof."}
{"file_name": "imgs/57_frontal.jpg", "text": "The facade features beige stucco walls, brown shingle roofing, and white trim. Decorative elements include circular wall art. White planters and minimalistic exterior lighting fixtures are present."}
{"file_name": "imgs/460_frontal.jpg", "text": "This house features a ranch-style architecture with a low-pitched roof, large windows, and an L-shaped layout. Its simple and expansive design is typical of suburban homes."}
{"file_name": "imgs/460_frontal.jpg", "text": "This charming single-story ranch-style home features a gable roof, dormer windows, two-car garage, and low-maintenance xeriscaped front yard, offering aesthetic appeal and functional outdoor space."}
{"file_name": "imgs/460_frontal.jpg", "text": "This single-story house features dormer windows, a two-car garage, and a simple front yard with minimal landscaping. It lacks balconies, terraces, or verandas."}
{"file_name": "imgs/460_frontal.jpg", "text": "The house features a brown stucco facade, tan roof shingles, and white-framed windows. Simple textures with minimal decorative elements and no visible exterior lighting fixtures."}
{"file_name": "imgs/130_frontal.jpg", "text": "Contemporary-style home featuring a communal pool house, manicured gardens, and an outdoor recreational area. Unique amenities include a spa center and well-maintained pathways within a gated community."}
{"file_name": "imgs/130_frontal.jpg", "text": "The house features a modern, minimalistic architectural style with clean lines, stucco walls, and a gabled roof with exposed beams."}
{"file_name": "imgs/130_frontal.jpg", "text": "The facade features beige and white stucco with gray trim, a slanted shingle roof, decorative cross-style vents, a recessed clock, and a wall-mounted light fixture above."}
{"file_name": "imgs/130_frontal.jpg", "text": "This house appears to be a single-story structure with a gable roof, compact layout, and functional entrance, looking like a pool house or utility building rather than a full dwelling."}
{"file_name": "imgs/379_frontal.jpg", "text": "Single-story mid-century modern home with a simple, rectangular layout, brick and metal façade, xeriscaped yard, gated driveway, and covered carport."}
{"file_name": "imgs/379_frontal.jpg", "text": "The house exhibits Mid-century modern architecture, marked by clean lines, flat planes, and large windows, with minimalistic landscaping and a combination of brick and siding materials."}
{"file_name": "imgs/379_frontal.jpg", "text": "The facade features beige brick and white paneling, a wrought-iron gate, gravel landscaping, and a vintage lamppost. Rectangular windows and a pitched roof complete the look."}
{"file_name": "imgs/379_frontal.jpg", "text": "The house is a single-story structure with a flat roof, a fenced courtyard, and a carport. It features minimalistic landscaping with gravel and a small front walkway."}
{"file_name": "imgs/27_frontal.jpg", "text": "The house showcases a Southwestern architectural style with stucco walls, arched windows, a clay tile roof, and desert landscaping, reflecting the regional aesthetic and climate."}
{"file_name": "imgs/27_frontal.jpg", "text": "Southwestern-style home with stucco exterior, arched windows, desert landscaping, and a central courtyard. Unique iron accents, warm earth tones, and drought-tolerant plants emphasize its regional charm and eco-friendly design."}
{"file_name": "imgs/27_frontal.jpg", "text": "Single-story home with stucco exterior, featuring arched windows, a central entrance with decorative iron door, and desert landscaping in the front yard. No visible balconies, terraces, or verandas."}
{"file_name": "imgs/27_frontal.jpg", "text": "The facade features smooth beige stucco, arched windows, wrought iron gate, with warm exterior lighting fixtures and desert landscaping, including cacti and gravel paths."}
{"file_name": "imgs/1_frontal.jpg", "text": "The facade features beige stucco, stacked stone accents, and arched window designs. Textured gravel landscaping integrates seamlessly, with minimal decorative elements and no visible exterior lighting fixtures."}
{"file_name": "imgs/1_frontal.jpg", "text": "This is a single-story house featuring a desert landscape, stone accents, and a covered entryway. It has an arched window and integrates elements of modern and Southwestern architecture."}
{"file_name": "imgs/1_frontal.jpg", "text": "This Southwestern-style home features a stucco and stone exterior, desert landscaping with cacti, and spacious single-story layout, blending harmonious indoor-outdoor living in a serene, arid environment."}
{"file_name": "imgs/1_frontal.jpg", "text": "The house features a Southwestern architectural style with stucco walls, a low-pitched roof, stone accents, and desert landscaping with cacti and gravel."}
{"file_name": "imgs/410_frontal.jpg", "text": "The house features a simple, contemporary ranch-style architecture with a low-pitched roof, attached garage, and clean, minimalistic lines, giving a suburban, modern appearance."}
{"file_name": "imgs/410_frontal.jpg", "text": "This modern, single-story home features a connected two-car garage, a fenced front yard, and ample windows for natural light. Its clean lines and neutral tones give it a contemporary appeal."}
{"file_name": "imgs/410_frontal.jpg", "text": "Single-story house with a detached garage. It features a small front porch area and large windows, and a simple, open design without balconies, terraces, or verandas."}
{"file_name": "imgs/410_frontal.jpg", "text": "The facade features light beige siding with white trim, smooth textures, minimal decorative elements, and white-framed windows. Simple wall-mounted lights flank the garage door."}
{"file_name": "imgs/140_frontal.jpg", "text": "Modern single-story home featuring clean lines, attached garage, manicured lawn, mature trees, and hillside backdrop, creating a serene and private atmosphere."}
{"file_name": "imgs/140_frontal.jpg", "text": "The house exhibits a contemporary architectural style with clean lines, minimalistic design, and integrated landscaping, emphasizing simplicity and functionality."}
{"file_name": "imgs/140_frontal.jpg", "text": "The exterior features beige stucco with muted brick accents, white garage door, manicured hedges, and pruned trees. There are no visible decorative elements or lighting fixtures on the facade."}
{"file_name": "imgs/140_frontal.jpg", "text": "Single-story house featuring a straightforward structure with a well-maintained lawn, an attached garage, and pruned trees lining the driveway."}
{"file_name": "imgs/296_frontal.jpg", "text": "The facade features beige stucco with matching garage doors, white-framed windows, stone accents on the porch, and wooden trimmings. The lighting fixtures are wall-mounted near the entrance."}
{"file_name": "imgs/296_frontal.jpg", "text": "This two-story house features a three-car garage, a front porch with stone accents, and a blend of pitched rooflines. It has a landscaped front yard and covered entrance."}
{"file_name": "imgs/296_frontal.jpg", "text": "This contemporary two-story home features a spacious layout, three-car garage, manicured front yard, and charming front porch, blending modern design with thoughtful outdoor spaces for relaxed suburban living."}
{"file_name": "imgs/296_frontal.jpg", "text": "A blend of contemporary and suburban styles, featuring a stucco exterior, multi-gable roof, brick accents, and a spacious driveway."}
{"file_name": "imgs/309_frontal.jpg", "text": "Two-story modern home with a gable roof, integrated garage, spacious driveway, landscaped yard with desert flora, and mountainous backdrop, combining practical design and serene outdoor ambiance."}
{"file_name": "imgs/309_frontal.jpg", "text": "The house features a suburban, mid-century modern style with a gabled roof, brick accents, and an attached garage, emphasizing modest and practical design elements for suburban living."}
{"file_name": "imgs/309_frontal.jpg", "text": "The facade features beige stucco with brown shingle roofing, white garage door, and brick accents. Decorative shrubbery aligns the front, with minimal lighting fixtures and a patterned driveway wall."}
{"file_name": "imgs/309_frontal.jpg", "text": "A two-story house featuring a front porch, attached garage, and landscaped yard with desert plants. The sloped roof and brickwork add a unique architectural touch."}
{"file_name": "imgs/357_frontal.jpg", "text": "The house features a Mediterranean architectural style, characterized by a red-tiled roof, stucco exterior, arched windows, and a landscaped lawn."}
{"file_name": "imgs/357_frontal.jpg", "text": "This charming Spanish-style home features a one-story layout, a red tile roof, manicured lawn, lush greenery, attached two-car garage, and a welcoming path leading to the entrance."}
{"file_name": "imgs/357_frontal.jpg", "text": "Single-story house with a red-tiled roof, a front lawn, a two-car garage, and no visible balconies, terraces, or verandas."}
{"file_name": "imgs/357_frontal.jpg", "text": "The facade features beige stucco walls, red clay roof tiles, white garage door, minimalistic lighting fixtures, and neat greenery with a small decorative flower bed near the walkway."}
{"file_name": "imgs/84_frontal.jpg", "text": "Contemporary home featuring a split-level design, expansive windows, hillside views, manicured landscaping, two-car garage, and a charming outdoor patio. Unique location provides serene, panoramic vistas."}
{"file_name": "imgs/84_frontal.jpg", "text": "The house features a contemporary ranch style with a low-pitched roof, expansive windows, clean lines, and integrated landscaping that blends with the surrounding natural environment."}
{"file_name": "imgs/84_frontal.jpg", "text": "The facade features light stucco walls, beige tiled roof, white trim, and large windows. Decorative elements include lush landscaping and a central figure sculpture, adding character."}
{"file_name": "imgs/84_frontal.jpg", "text": "Single-story home with a tiled roof, an attached garage, covered porch entry, and landscaped front yard. Situated on a hillside, featuring multiple large windows and lush surroundings."}
{"file_name": "imgs/79_frontal.jpg", "text": "This split-level home features mid-century modern architecture with a double-door entry, bay window, spacious lawn, and detached garage, highlighted by tidy landscaping and mature trees for added charm."}
{"file_name": "imgs/79_frontal.jpg", "text": "This house features a split-level architectural style, characterized by its elevated front entrance, large bay window, and a combination of brick and siding exterior elements."}
{"file_name": "imgs/79_frontal.jpg", "text": "The facade features beige brick, horizontal grey siding, white entry doors, and large windows. Decorative elements include a stone entryway and dual lamp post lighting fixtures."}
{"file_name": "imgs/79_frontal.jpg", "text": "The house is a two-story structure with a split-level design, featuring bay windows and a dual entrance with a central staircase."}
{"file_name": "imgs/235_frontal.jpg", "text": "This is a two-story house with a three-car garage, a front balcony, and gable roofs, featuring shutters on the windows for a classic architectural look."}
{"file_name": "imgs/235_frontal.jpg", "text": "The facade features beige stucco walls, green shutters, brown trim, and red-brown base. There are white garage doors with decorative windows and two lantern-style lighting fixtures."}
{"file_name": "imgs/235_frontal.jpg", "text": "The house features a contemporary suburban architectural style with stucco walls, tiled gable roof, and green shutters above a spacious three-car garage."}
{"file_name": "imgs/235_frontal.jpg", "text": "Modern two-story home featuring Mediterranean style, spacious driveway, three-car garage, manicured lawn, large windows, balconies, and green shutters. Unique blend of elegance and functionality."}
{"file_name": "imgs/327_frontal.jpg", "text": "The house features a Gambrel roof with dormer windows and a wrap-around front porch, giving it a classic barn-like architectural style."}
{"file_name": "imgs/327_frontal.jpg", "text": "Charming gambrel-style home with multiple dormer windows, spacious wraparound porch, rustic exterior, large yard, and scenic mountainous backdrop, creating a unique blend of comfort and countryside allure."}
{"file_name": "imgs/327_frontal.jpg", "text": "The house is two stories with a gambrel roof, featuring dormer windows and a large, wrap-around porch that resembles a veranda. It has a unique barn-style design."}
{"file_name": "imgs/327_frontal.jpg", "text": "The facade combines dark shingle roofing with pale green wood siding, white trim, and a wraparound porch. Dormer windows, a cupola, and simple white railings add visual interest."}
{"file_name": "imgs/193_frontal.jpg", "text": "The house exhibits a charming Tudor Revival style, featuring steeply pitched gable roofs, a prominent arched doorway, and half-timbering details."}
{"file_name": "imgs/193_frontal.jpg", "text": "Charming Tudor-style home with steep gable roof, arched doorway, large windows, and a landscaped front yard with stone wall, creating a picturesque, inviting exterior."}
{"file_name": "imgs/193_frontal.jpg", "text": "This single-story house features a pitched roof, large front window, arched entryway, and a stone-lined front yard with landscaped garden."}
{"file_name": "imgs/193_frontal.jpg", "text": "The facade combines cream stucco, dark trim, and stone detailing. Decorative elements include an arched wooden door and dormer windows. Subtle exterior lighting frames the entrance."}
{"file_name": "imgs/245_frontal.jpg", "text": "A single-story house featuring a three-car garage, a pitched roof, and a small covered porch. The exterior includes landscaping with palm trees and bushes."}
{"file_name": "imgs/245_frontal.jpg", "text": "The exterior features gray stucco and beige siding with white trim, textured roof tiles, and a lantern style lighting fixture above the garage."}
{"file_name": "imgs/245_frontal.jpg", "text": "This house has a modern suburban architectural style, characterized by a gable roof, attached three-car garage, light colors, and landscaped front yard."}
{"file_name": "imgs/245_frontal.jpg", "text": "This single-story modern-ranch home features a spacious three-car garage, manicured front garden with palm trees, stucco exterior with horizontal siding, and a charming front porch."}
{"file_name": "imgs/342_frontal.jpg", "text": "Single-story home featuring large front windows, a gabled roof, and a concrete driveway. Minimalist design with no visible balconies, terraces, or verandas."}
{"file_name": "imgs/342_frontal.jpg", "text": "The facade features horizontal peach siding, large rectangular windows with white trim, decorative breeze blocks, and a white gable roof. There are shrubs beneath the windows; minimal lighting fixtures visible."}
{"file_name": "imgs/342_frontal.jpg", "text": "This house features a mid-20th century, single-story ranch-style architecture with horizontal siding, a low-pitched gable roof, and large, front-facing windows."}
{"file_name": "imgs/342_frontal.jpg", "text": "This single-story, mid-century modern home features a simple rectangular layout, large front windows, a spacious driveway, and a distinctive pastel exterior, encapsulating minimalist charm and functionality."}
{"file_name": "imgs/91_frontal.jpg", "text": "The facade features stucco walls, red tile roofing, and white framed windows. Decorative wrought iron elements, a pergola, and integrated lighting fixtures enhance the exterior aesthetic."}
{"file_name": "imgs/91_frontal.jpg", "text": "This single-story house features a tiled roof, a spacious patio area, large windows, and an outdoor seating area. It includes architectural elements like columns and a pergola over the patio."}
{"file_name": "imgs/91_frontal.jpg", "text": "This Mediterranean-style home boasts an open floor plan, red-tiled roof, expansive patio with seating area, large windows, and lush landscaping, set against scenic hill views."}
{"file_name": "imgs/91_frontal.jpg", "text": "The house features Mediterranean architecture with stucco walls, red-tiled roof, expansive windows, and an open courtyard design, blending indoor and outdoor living spaces harmoniously."}
{"file_name": "imgs/220_frontal.jpg", "text": "The house exhibits mid-century ranch style architecture with low-pitched rooflines, horizontal wood siding, large windows, and a blend of brick and stone detailing."}
{"file_name": "imgs/220_frontal.jpg", "text": "Charming ranch-style home with a one-story layout, sprawling front yard, spacious driveway, stone accents, and inviting front porch, complemented by tropical landscaping creating an idyllic retreat."}
{"file_name": "imgs/220_frontal.jpg", "text": "This single-story house features a two-car garage, a front porch with seating, and a mix of stone and wooden exterior elements, creating a cozy, inviting main entrance."}
{"file_name": "imgs/220_frontal.jpg", "text": "The facade features light brown horizontal siding, beige stone accents, and a grey shingled roof. Decorative elements include white trim, patio furniture, and a small wall-mounted light fixture."}
{"file_name": "imgs/332_frontal.jpg", "text": "Single-story house featuring an extensive veranda with a pergola-style roof, large glass windows, and a well-landscaped lawn. Unique decorative elements and outdoor seating are visible."}
{"file_name": "imgs/332_frontal.jpg", "text": "The facade features light gray siding, large glass windows, and a white pergola. Decorative elements include statues and outdoor seating, with subtle wall-mounted lighting fixtures."}
{"file_name": "imgs/332_frontal.jpg", "text": "The house has a contemporary style with a flat roof, large glass doors, and a pergola shaded patio. The exterior appears minimalist with clean lines."}
{"file_name": "imgs/332_frontal.jpg", "text": "Charming ranch-style home with an open-layout, expansive windows, and a beautiful pergola-covered patio. Outdoor features include lush lawn, garden statues, and scenic views, creating a perfect retreat."}
{"file_name": "imgs/186_frontal.jpg", "text": "The house is two stories with a mix of flat and tiled gable roofs, featuring a balcony, an arched facade, and multiple large windows."}
{"file_name": "imgs/186_frontal.jpg", "text": "Stucco exterior in beige, red clay tiled roof, arched windows and doors, simple landscaping, minimal decorative elements, and warm ambient lighting near entrances."}
{"file_name": "imgs/186_frontal.jpg", "text": "The house features a Mediterranean architectural style with stucco walls, red-tiled roofs, arched doorways, and large windows, exuding a warm, inviting ambiance."}
{"file_name": "imgs/186_frontal.jpg", "text": "This Mediterranean-style home features a two-story layout, red-tiled roof, manicured lawn, modern porch, and large windows, creating a unique blend of classic elegance and contemporary comfort."}
{"file_name": "imgs/250_frontal.jpg", "text": "The house features a contemporary suburban architectural style, with stucco exterior, gabled roof, symmetrical façade, and three-car garage."}
{"file_name": "imgs/250_frontal.jpg", "text": "Two-story suburban home with modern architectural style, featuring three-car garage, landscaped front yard, manicured hedges, and a spacious driveway, offering a charming curb appeal."}
{"file_name": "imgs/250_frontal.jpg", "text": "This two-story house features a three-car garage, multiple large windows, and a modest balcony. The front yard has well-maintained lawns and shrubs adding to the curb appeal."}
{"file_name": "imgs/250_frontal.jpg", "text": "Smooth beige stucco facade, gray trim, and a matching gray shingle roof. Decorative blue shutters, two carriage-style wall-mounted lanterns, and a three-car garage with paneled doors."}
{"file_name": "imgs/391_frontal.jpg", "text": "The facade features cream-colored siding with dark trim, textured lattice panels, large rectangular windows, minimal decorative elements, and simple outdoor lighting underneath a covered porch. Palms provide natural decoration."}
{"file_name": "imgs/391_frontal.jpg", "text": "The house is a single-story unit featuring a front verandah and a carport. It has a simple, rectangular layout with several windows for natural light."}
{"file_name": "imgs/391_frontal.jpg", "text": "A charming, single-story ranch home featuring a spacious carport, low-maintenance desert landscaping with palm trees, and a covered side porch, all set against a picturesque mountain backdrop."}
{"file_name": "imgs/391_frontal.jpg", "text": "The house features a mid-century modern style with a simple, flat roof, large windows, and an attached carport, typical of the desert Southwest region."}
{"file_name": "imgs/517_frontal.jpg", "text": "The house features a Mediterranean architectural style, with stucco walls, red-tiled roofs, arched garage doors, and lush landscaping."}
{"file_name": "imgs/517_frontal.jpg", "text": "California ranch-style home with stucco exterior, three-car garage, large front yard with tree, inviting courtyard, red-tiled roof, arched windows, and a prominent central fountain."}
{"file_name": "imgs/517_frontal.jpg", "text": "Single-story house with a three-car garage, a front porch with columns, and a tiled roof. Features a front yard with a fountain and driveway."}
{"file_name": "imgs/517_frontal.jpg", "text": "The house features stucco walls, terracotta roof tiles, beige garage doors, and decorative elements like a central fountain and exterior lantern-style lighting fixtures. Earthy tones and textures dominate."}
{"file_name": "imgs/42_frontal.jpg", "text": "A two-story house featuring three garage doors, a front-facing balcony, and a symmetrically designed facade with a combination of brick and siding materials."}
{"file_name": "imgs/42_frontal.jpg", "text": "The facade features beige siding, red brick accents, cream-colored garage doors, white trim, arched windows, lantern-style lighting, and a mix of textured and smooth surfaces."}
{"file_name": "imgs/42_frontal.jpg", "text": "The house features a suburban contemporary style with brick and siding facade, multiple gables, oversized windows, and attached triple garage."}
{"file_name": "imgs/42_frontal.jpg", "text": "Modern two-story home featuring brick and wood exterior, three-car garage, manicured front lawn, arched window, and mature landscaping, blending contemporary and traditional design elements."}
{"file_name": "imgs/488_frontal.jpg", "text": "This is a single-story mobile home featuring a covered front porch, side stairs, and a carport. The structure includes straightforward lines and a fenced front area."}
{"file_name": "imgs/488_frontal.jpg", "text": "The facade is white with vertical paneling, metal railings, and posts. Decorative elements include a front sign, shrubs, and a mailbox. Covered porch and carport, minimal lighting fixtures."}
{"file_name": "imgs/488_frontal.jpg", "text": "The house exhibits a classic mobile home architectural style with a simple rectangular design, aluminum siding, and a flat roof. It includes an attached carport and small front steps."}
{"file_name": "imgs/488_frontal.jpg", "text": "This charming manufactured home features a modest, rectangular layout with an extended carport, front porch, gravel driveway, and a fenced yard, set against a serene hillside backdrop."}
{"file_name": "imgs/125_frontal.jpg", "text": "The facade features beige stucco, terracotta roof tiles, decorative iron railings, and classical columns. Lighting fixtures are minimal, and textures include smooth walls and brick paving."}
{"file_name": "imgs/125_frontal.jpg", "text": "The house is a two-story structure with multiple balconies, a central entrance supported by pillars, and features two garages on either side."}
{"file_name": "imgs/125_frontal.jpg", "text": "This Mediterranean-style home features a grand entrance, a spacious balcony, multiple garages, and a basketball hoop. Stucco exterior, red-tiled roof, and elegant columns elevate its unique charm."}
{"file_name": "imgs/125_frontal.jpg", "text": "The house showcases a Mediterranean architectural style with stucco walls, red-tiled roof, arched windows, and columns, complemented by a spacious balcony and wrought iron details."}
{"file_name": "imgs/475_frontal.jpg", "text": "The house is two stories with a red-tiled roof, featuring balconies on the upper level and surrounded by a wooden fence in a lush environment."}
{"file_name": "imgs/475_frontal.jpg", "text": "The home features a red-tiled roof, beige walls with stucco texture, and wooden decorative elements. No visible lighting fixtures or additional decorative patterns present."}
{"file_name": "imgs/475_frontal.jpg", "text": "The house features a Mediterranean style with a red-tiled roof, stucco walls, and an emphasis on outdoor living spaces."}
{"file_name": "imgs/475_frontal.jpg", "text": "Spanish-style home with tile roofing and large windows, situated amidst lush greenery. Features an expansive horse arena, wooden fencing, and a serene rural backdrop. Unique blend of rustic charm and modern amenities."}
{"file_name": "imgs/32_frontal.jpg", "text": "This house features a single-story design with a covered front porch, a spacious paved driveway, and a two-car garage, all set within a beautifully landscaped yard."}
{"file_name": "imgs/32_frontal.jpg", "text": "The facade features earthy-toned stucco and stonework, a wooden door, and warm exterior lighting. Brick-patterned driveway, neatly landscaped garden, and rustic decorative elements enhance the overall appeal."}
{"file_name": "imgs/32_frontal.jpg", "text": "The house exhibits a modern Southwestern architectural style, characterized by stucco walls, tile roof, exposed wood, and stone accents, complemented by a landscaped front yard."}
{"file_name": "imgs/32_frontal.jpg", "text": "Charming contemporary home with a welcoming front porch, spacious single-story layout, stone accents, manicured lawn, shaded tree-lined driveway, and a distinctive rustic garage door."}
{"file_name": "imgs/155_frontal.jpg", "text": "The facade features smooth, olive-green siding with a beige trim and stone texture accent wall. Simple, under-eave lighting fixtures and white pillars decorate the entrance."}
{"file_name": "imgs/155_frontal.jpg", "text": "This is a single-story house with a simple structure, featuring a covered porch area, a small front patio, and surrounded by mature trees and light landscaping."}
{"file_name": "imgs/155_frontal.jpg", "text": "Charming single-story ranch home featuring a spacious patio, lush landscaping, and large evergreens. The green siding and clean lines highlight its welcoming and serene outdoor living ambiance."}
{"file_name": "imgs/155_frontal.jpg", "text": "The house features a Ranch-style architecture with a single-story layout, horizontal lines, and an open patio, reflecting mid-20th-century American suburban design."}
{"file_name": "imgs/405_frontal.jpg", "text": "Single-story house featuring a wide front enclosed porch, a covered carport, and a simple landscape with a mixture of grass and decorative stones."}
{"file_name": "imgs/405_frontal.jpg", "text": "The facade features beige siding with brown trim, large windows, and decorative stone skirting. Simple landscaping with small plants and no visible lighting fixtures or decorative elements."}
{"file_name": "imgs/405_frontal.jpg", "text": "The house exhibits a mid-20th century mobile home style with simple, rectangular shape, large windows, and modest landscaping."}
{"file_name": "imgs/405_frontal.jpg", "text": "This single-story ranch-style home features an enclosed porch, carport, and minimalistic landscaping, combining functionality with simplicity for comfortable living and easy maintenance."}
{"file_name": "imgs/283_frontal.jpg", "text": "Modern two-story home with stucco and stone facade, blue shutters, attached garage, manicured lawn, palm trees, charming porch, and distinctive gable roofs on a corner lot."}
{"file_name": "imgs/283_frontal.jpg", "text": "The house exhibits a modern suburban style with a two-story design, light stucco exterior, stone accents, and a gable roof."}
{"file_name": "imgs/283_frontal.jpg", "text": "The facade features beige stucco, stone veneer accents, blue shutters, white trim, and a white garage door. Decorative elements include a hanging lantern light fixture near the garage."}
{"file_name": "imgs/283_frontal.jpg", "text": "The house has two stories, two-car garage, a mix of stone and stucco exterior, and features a small front porch area."}
{"file_name": "imgs/300_frontal.jpg", "text": "The facade features a beige stucco exterior, brown shutters, and a red-tiled roof. Decorative elements include a wall-mounted lantern light fixture and manicured greenery around the entrance."}
{"file_name": "imgs/300_frontal.jpg", "text": "The house is a two-story structure with a gable roof, featuring a two-car garage, multiple windows, and a small front garden."}
{"file_name": "imgs/300_frontal.jpg", "text": "This charming two-story, Mediterranean-style home features a two-car garage, terra cotta roof tiles, manicured lawn, and a stucco exterior with modern shutters, blending elegance with functionality."}
{"file_name": "imgs/300_frontal.jpg", "text": "The house features a Mediterranean architectural style with stucco walls, clay tile roof, shuttered windows, and a simple, symmetrical facade."}
{"file_name": "imgs/149_frontal.jpg", "text": "The facade features tan stucco walls, brown trim and garage doors, and a tiled roof. The front pathway and stairs have a stone texture, with greenery and white flowers decorating the exterior."}
{"file_name": "imgs/149_frontal.jpg", "text": "This two-story house features a stucco exterior, multiple gabled roofs, arched garage doors, and large windows. It has a manicured front yard and an elevated entryway."}
{"file_name": "imgs/149_frontal.jpg", "text": "This elegant Mediterranean-style home features a symmetrical layout, terracotta roof tiles, lush landscaped gardens, a three-car garage, and inviting pathways, combining luxury and charm in a serene setting."}
{"file_name": "imgs/149_frontal.jpg", "text": "The house features a Mediterranean Revival style, characterized by stucco walls, tiled roofs, arched entryways, and a focus on blending with natural surroundings."}
{"file_name": "imgs/419_frontal.jpg", "text": "Single-story house with a flat roof, a large tree in front, and an attached carport. It features a low brick wall bordering the property."}
{"file_name": "imgs/419_frontal.jpg", "text": "The facade features horizontal white siding, large windows, light gray trim, and a concrete block wall. An olive tree and minimal landscaping are present; there are no visible lighting fixtures."}
{"file_name": "imgs/419_frontal.jpg", "text": "This house depicts Mid-century modern architectural style with clean lines, large windows, and a flat roof, complemented by simple landscaping and neutral tones."}
{"file_name": "imgs/419_frontal.jpg", "text": "Single-story home with a low-pitched roof, wide front windows, carport, and xeriscaped yard featuring a large tree and cactus. Unique for its minimalist landscape and block wall front."}
{"file_name": "imgs/8_frontal.jpg", "text": "This Southwestern-style home features stucco and stone exterior, a spacious, asymmetrical layout, desert landscaping, a central courtyard, and unique architectural elements like a chimney and terracotta roof tiles."}
{"file_name": "imgs/8_frontal.jpg", "text": "The house showcases a southwestern architectural style, with stucco walls, flat roofs, stone accents, and an emphasis on blending with the desert landscape."}
{"file_name": "imgs/8_frontal.jpg", "text": "The facade features beige stucco walls, stone accents, and clay tile roofing. Decorative lantern light fixtures flank the entrance. The facade is enhanced with desert landscaping."}
{"file_name": "imgs/8_frontal.jpg", "text": "This single-story house features a flat roof, stucco exterior with stone accents, a prominent entryway, and multiple small verandas. It has a desert landscape."}
{"file_name": "imgs/262_frontal.jpg", "text": "Charming rustic home with timber exterior, nestled in lush greenery, featuring a winding path entry, large windows, and a serene forest environment, blending harmoniously with nature."}
{"file_name": "imgs/262_frontal.jpg", "text": "The house features a rustic, mid-century modern style with wooden exterior siding, large windows, and integration with its natural surroundings."}
{"file_name": "imgs/262_frontal.jpg", "text": "The facade features wooden siding with warm, natural tones, complemented by brick accents. Decorative elements include large windows and potted plants. There are no evident lighting fixtures."}
{"file_name": "imgs/262_frontal.jpg", "text": "The house is a single-story structure with a prominent front veranda, surrounded by trees and greenery, featuring large windows and warm wooden exterior elements."}
{"file_name": "imgs/370_frontal.jpg", "text": "The facade features vertical siding in beige with brown trim. Decorative windows dominate the center. The concrete base and driveway, paired with minimal landscaping, create a clean, modern look."}
{"file_name": "imgs/370_frontal.jpg", "text": "This single-story house features a modern facade with large vertical windows, an extended roofline, and two carports on either side. No balconies, terraces, or verandas are visible."}
{"file_name": "imgs/370_frontal.jpg", "text": "This contemporary modular home features a symmetrical, gabled facade, ample natural light through large windows, a double carport, and a minimalist outdoor landscape with a small, decorative stone area."}
{"file_name": "imgs/370_frontal.jpg", "text": "The house features simple, geometric lines with vertical wood paneling, large windows, and a carport, indicative of a mid-century modern or manufactured home style."}
{"file_name": "imgs/139_frontal.jpg", "text": "The facade features beige stucco walls, terracotta tiled roofs, and red brick pathways. Decorative elements include a central stone fountain. The landscaping integrates neatly trimmed hedges."}
{"file_name": "imgs/139_frontal.jpg", "text": "This two-story house features a red-tiled roof, exterior stairway, balconies, and a central courtyard with a fountain. The architecture includes multiple windows and well-maintained landscaping."}
{"file_name": "imgs/139_frontal.jpg", "text": "Charming Mediterranean home featuring a red-tiled roof, stucco facade, central courtyard with a fountain, manicured hedges, and stone pathways, blending classic elegance with serene outdoor spaces."}
{"file_name": "imgs/139_frontal.jpg", "text": "The house features a Mediterranean architectural style with stucco walls, red-tiled roofs, and a central courtyard fountain, emphasizing open-air and outdoor living areas."}
{"file_name": "imgs/469_frontal.jpg", "text": "This is a two-story house featuring a large front veranda with railings, dormer windows, and a prominent chimney, adding to its charming architectural design."}
{"file_name": "imgs/469_frontal.jpg", "text": "The facade features light beige siding, a dark grey roof, white railings, and brick pathway. The porch has a wreath and American flag, with porch lighting and simple landscaping."}
{"file_name": "imgs/469_frontal.jpg", "text": "This house features a ranch-style architecture with dormer windows, a large front porch, and a gable roof. It has a simple, single-story design characteristic of suburban homes."}
{"file_name": "imgs/469_frontal.jpg", "text": "Charming ranch-style home with dormer windows, inviting front porch, expansive yard, and scenic views. Unique features include a wraparound deck, outdoor stone pathways, and ample natural light in all rooms."}
{"file_name": "imgs/494_frontal.jpg", "text": "The house is a single-story structure with a rectangular layout, featuring a wraparound covered veranda or porch, situated in a sprawling rural setting surrounded by open fields."}
{"file_name": "imgs/494_frontal.jpg", "text": "The facade features white siding with a brown shingle roof. Minimalist and functional, the structure lacks prominent decorative elements or visible exterior lighting fixtures."}
{"file_name": "imgs/494_frontal.jpg", "text": "This house features a simple ranch-style design, characterized by a single-story structure, rectangular shape, and a low-pitched roof, common in rural and farmland settings."}
{"file_name": "imgs/494_frontal.jpg", "text": "Charming ranch-style home featuring a single-story layout, spacious veranda, surrounded by serene pastures, rustic fencing, and mature trees, complete with breathtaking countryside views and expansive outdoor spaces."}
{"file_name": "imgs/212_frontal.jpg", "text": "Contemporary two-story home with vertical siding, integrated garage, and carport. Features a straightforward facade, driveway, minimal landscaping, and proximity to neighboring homes, emphasizing its urban setting."}
{"file_name": "imgs/212_frontal.jpg", "text": "The house features a simple two-story design with horizontal siding, minimal ornamentation, and an integrated garage, characteristic of mid-20th century suburban architecture."}
{"file_name": "imgs/212_frontal.jpg", "text": "The facade features beige horizontal siding, black trim, and a dark garage door. Decorative elements include a light fixture and house number under an overhang."}
{"file_name": "imgs/212_frontal.jpg", "text": "The house is a two-story structure with a front garage and covered area. It lacks balconies, terraces, or verandas."}
{"file_name": "imgs/437_frontal.jpg", "text": "The facade features pale yellow siding with white trim, arched windows, and decorative shrubs. The double garage door and entryway are simple, with no visible lighting fixtures."}
{"file_name": "imgs/437_frontal.jpg", "text": "Single-story house featuring a two-car garage, arched windows, and a symmetrical roof design. Simple landscaping enhances the frontage, with no balconies, terraces, or verandas visible."}
{"file_name": "imgs/437_frontal.jpg", "text": "This charming single-story ranch-style home features a spacious layout, a two-car garage, large arched living room windows, a neat lawn, and hillside surroundings."}
{"file_name": "imgs/437_frontal.jpg", "text": "The house features a modern ranch-style architecture with a single-story layout, gable roof, attached garage, and large arched window detailing."}
{"file_name": "imgs/167_frontal.jpg", "text": "This single-story house features a prominent front deck with railing, large windows, and a varied roofline with gables, enhancing its architectural appeal."}
{"file_name": "imgs/167_frontal.jpg", "text": "The facade features light beige siding, white trim, and grid-pattern skirting. Simple railings frame the wooden deck, accented by an outdoor umbrella and minimal landscaping. No visible decorative elements or lighting fixtures."}
{"file_name": "imgs/167_frontal.jpg", "text": "This house features a modern manufactured home style with a gabled roof, large windows, and a raised wooden deck."}
{"file_name": "imgs/167_frontal.jpg", "text": "This charming ranch-style home features a spacious deck, large windows, and a scenic yard with vibrant bushes. Its inviting open layout is perfect for outdoor entertaining and relaxation."}
{"file_name": "imgs/70_frontal.jpg", "text": "The facade features white siding with green roofing, arched and square windows, a raised stone patio, and red umbrellas providing shade for outdoor seating."}
{"file_name": "imgs/70_frontal.jpg", "text": "Single-story house with a large patio and terrace area featuring outdoor seating and umbrellas. The structure includes several windows and a prominent front gable."}
{"file_name": "imgs/70_frontal.jpg", "text": "Charming ranch-style home with an open layout features a spacious patio, tiered landscaping, large windows, and vibrant outdoor seating. It combines modern amenities with classic architectural elegance."}
{"file_name": "imgs/70_frontal.jpg", "text": "This house features a modern ranch-style architecture with clean lines, single-story layout, large windows, and an expansive lawn."}
{"file_name": "imgs/525_frontal.jpg", "text": "Modern two-story home with stucco exterior, attached garage, manicured lawn, large windows, and charming shutters. Unique curved driveway, vibrant landscaped garden, and inviting front entrance."}
{"file_name": "imgs/525_frontal.jpg", "text": "The house features a modern suburban style with a stucco exterior, gable roofs, integrated garage, and clean, symmetrical lines."}
{"file_name": "imgs/525_frontal.jpg", "text": "The facade features light grey stucco, white trim, and grey shutters. Subtle decorative molding accents windows, with dawn-to-dusk light fixtures by the garage and entryway."}
{"file_name": "imgs/525_frontal.jpg", "text": "This two-story house features a front balcony, a two-car garage, and large windows, with well-manicured front yard landscaping."}
{"file_name": "imgs/447_frontal.jpg", "text": "The house features beige stucco walls, a red-tiled roof, and brown garage doors. Decorative elements include lantern-style exterior lights and a brick border around the driveway."}
{"file_name": "imgs/447_frontal.jpg", "text": "Single-story house with a sloping roof, attached two-car garage, and a covered entry. Features a landscaped front yard and a driveway."}
{"file_name": "imgs/447_frontal.jpg", "text": "Charming stucco ranch-style home with red-tile roof, attached two-car garage, landscaped front yard, mature trees, mountain views, and a spacious, fenced backyard offering a peaceful, nature-filled ambiance. Ideal for relaxation."}
{"file_name": "imgs/447_frontal.jpg", "text": "Tiled roof, stucco walls, and simple lines reflect a Southwestern or Mediterranean architectural style with an emphasis on outdoor living spaces."}
{"file_name": "imgs/117_frontal.jpg", "text": "Single-story house with a two-car garage, modest front porch, and simple, clean exterior. Features a small, landscaped front yard and a wide driveway."}
{"file_name": "imgs/117_frontal.jpg", "text": "The facade features beige stucco with a light brown shingle roof, a wooden fence, a decorative entry light, and shrubbery. The garage has inset patterns and windows."}
{"file_name": "imgs/117_frontal.jpg", "text": "This house features a modern ranch-style architecture with a low-pitched gable roof, stucco exterior, attached garage, and minimalistic landscaping."}
{"file_name": "imgs/117_frontal.jpg", "text": "This cozy Ranch-style home features a two-car garage, inviting front porch, vibrant greenery, and a scenic backdrop of mountains, offering both comfort and picturesque views."}
{"file_name": "imgs/150_frontal.jpg", "text": "Neutral-toned stucco facade, textured walls, and decorative trim. Arched windows, tropical landscaping, and modern outdoor lighting enhance the exterior. Triple garage with smooth grey doors complements the sophisticated aesthetic."}
{"file_name": "imgs/150_frontal.jpg", "text": "This two-story house features a three-car garage, large windows, and a balcony. Its unique architectural elements include a grand entrance with pillars and lush landscaping surrounding the property."}
{"file_name": "imgs/150_frontal.jpg", "text": "This contemporary Mediterranean-style home boasts a symmetrical facade, open layout, multiple large windows, 3-car garage, lush tropical landscaping, and ornate entryway, making it distinctive and inviting."}
{"file_name": "imgs/150_frontal.jpg", "text": "The house exhibits a contemporary Mediterranean style, characterized by a stucco exterior, arched windows, and a clay-tile roof, surrounded by lush landscaping and palm trees."}
{"file_name": "imgs/400_frontal.jpg", "text": "Single-story house with a landscaped front yard, covered carport, large front windows, and a side entrance. Unique features include a front veranda protected by a wooden lattice."}
{"file_name": "imgs/400_frontal.jpg", "text": "The facade features white siding, a horizontal panel texture, and a light grey accent. Decorative latticework and minimalistic lighting fixtures are present, with desert landscaping elements including rocks and palm trees."}
{"file_name": "imgs/400_frontal.jpg", "text": "The house features a mid-century modern style, characterized by clean lines, large windows, a flat roof, and minimalist landscaping with desert plants."}
{"file_name": "imgs/400_frontal.jpg", "text": "This charming mid-century modern home features a sleek single-story layout, desert landscaping, palm trees, a carport, and a semi-private front patio for outdoor relaxation."}
{"file_name": "imgs/319_frontal.jpg", "text": "The facade features white siding with blue trim, a concrete driveway, and a front porch with white railings. Decorative lantern-style lighting fixtures are mounted beside the garage door."}
{"file_name": "imgs/319_frontal.jpg", "text": "This single-story house features an attached garage, a covered veranda with a white railing, and manicured front lawn. No balconies or terraces are visible."}
{"file_name": "imgs/319_frontal.jpg", "text": "Charming ranch-style home with a spacious two-car garage, inviting front porch, well-maintained lawn, and picturesque hillside views, offering a serene and welcoming atmosphere."}
{"file_name": "imgs/319_frontal.jpg", "text": "The house features a simple, modern suburban architectural style with a gable roof, attached garage, and a covered front porch with railing."}
{"file_name": "imgs/286_frontal.jpg", "text": "This minimalist mobile home features a classic, single-story design, an attached carport, and distinguished by tall palm trees, creating a unique desert aesthetic."}
{"file_name": "imgs/286_frontal.jpg", "text": "The house exhibits a mid-20th century manufactured home style, characterized by simple, functional design, aluminum siding, and a carport. The palm trees add a Southwestern desert aesthetic."}
{"file_name": "imgs/286_frontal.jpg", "text": "The facade features beige horizontal siding, green roof trim, metal awnings over windows, and vertical ribbed patterns with no visible decorative elements or exterior lighting fixtures."}
{"file_name": "imgs/286_frontal.jpg", "text": "The house is a single-story structure with a covered carport. It features a shaded front and minimalistic design without balconies, terraces, or verandas."}
{"file_name": "imgs/37_frontal.jpg", "text": "This house features a circular stone tower entrance, single-story layout, tiled roof, and a central courtyard with a fountain, offering an inviting outdoor seating area."}
{"file_name": "imgs/37_frontal.jpg", "text": "The facade features a stone turret, olive green stucco walls, and terracotta roof tiles. Decorative wrought iron door, sconce lighting, and a central stone fountain enhance the courtyard."}
{"file_name": "imgs/37_frontal.jpg", "text": "The house features Mediterranean architectural style with a circular stone tower, stucco walls, terracotta roof tiles, arched entryway, and a courtyard fountain."}
{"file_name": "imgs/37_frontal.jpg", "text": "This Mediterranean-style home features a central stone tower, spacious courtyard with fountain, arched iron doors, and beautiful outdoor seating areas, creating an elegant and inviting atmosphere."}
{"file_name": "imgs/120_frontal.jpg", "text": "The facade features beige stucco walls with minimal decorative elements, green trim, varied textures, and a simple porch light fixture."}
{"file_name": "imgs/120_frontal.jpg", "text": "Single-story house with a flat roof, featuring a central entrance, large windows, a front patio area with columns, and surrounded by greenery."}
{"file_name": "imgs/120_frontal.jpg", "text": "Single-story, mid-century modern home featuring a flat roof, open layout, large windows, and covered patio, surrounded by lush greenery and mature trees, creating a peaceful, naturalistic setting."}
{"file_name": "imgs/120_frontal.jpg", "text": "The house features a simple, mid-century modern architectural style with a low-pitched roof, wide eaves, horizontal lines, and large windows. The exterior is minimalistic and unadorned."}
{"file_name": "imgs/470_frontal.jpg", "text": "Single-story house with a covered front porch, surrounded by a lush garden with stone benches and a path leading to the entrance."}
{"file_name": "imgs/470_frontal.jpg", "text": "The facade features white horizontal siding, dark trim, and a covered porch with white railings and columns. Decorative elements include traditional outdoor furniture and minimalistic landscaping."}
{"file_name": "imgs/470_frontal.jpg", "text": "The house features a simple, traditional ranch-style architecture with a single story, gabled roof, white exterior, and an inviting front porch with railings."}
{"file_name": "imgs/470_frontal.jpg", "text": "Charming cottage-style home with wraparound porch, lush landscaping, stone paths, and garden seating areas. Bright, inviting exterior with classic design and serene, nature-filled surroundings."}
{"file_name": "imgs/369_frontal.jpg", "text": "The facade features beige horizontal siding, brown trim accents, and black decorative bars on windows. A concrete driveway with an adjacent rock garden and minimal shrubbery is present."}
{"file_name": "imgs/369_frontal.jpg", "text": "Single-story house with a covered carport and a patio area. The exterior features modest landscaping with gravel and shrubs. The roof has a slight overhang accenting the structure."}
{"file_name": "imgs/369_frontal.jpg", "text": "This modern, low-maintenance desert home features a spacious carport, clean-lined architecture, minimalist landscaping, paved driveway, and covered outdoor seating, blending functionality with uncluttered design."}
{"file_name": "imgs/369_frontal.jpg", "text": "The house features a Mid-century modern architectural style, characterized by its flat roof, minimalist design, and horizontal lines."}
{"file_name": "imgs/394_frontal.jpg", "text": "The facade features blue vertical siding, large windows, and a minimalist design. Decorative elements include a simple wall light fixture and a gravel front yard with short shrubs."}
{"file_name": "imgs/394_frontal.jpg", "text": "Single-story house with a flat roof, featuring a large front window, a sloped metal roof overhang carport, and minimalistic desert landscaping."}
{"file_name": "imgs/394_frontal.jpg", "text": "Mid-century modern home featuring a unique angular roof, open layout, spacious carport, minimalist desert landscaping, and large floor-to-ceiling windows that create a bright, airy ambiance."}
{"file_name": "imgs/394_frontal.jpg", "text": "Mid-century modern: characterized by clean lines, large windows, a low-pitched roof, and an integration with nature, emphasizing simplicity and functionality."}
{"file_name": "imgs/47_frontal.jpg", "text": "The house is a single-story structure with a spacious backyard, featuring a chimney, large windows, and a screened-in porch/veranda. The roof is gabled."}
{"file_name": "imgs/47_frontal.jpg", "text": "The facade is clad in light beige siding with horizontal lines, accented by a gabled roof in gray shingles. The exterior features white trim around windows and a screened-in porch."}
{"file_name": "imgs/47_frontal.jpg", "text": "Single-story ranch-style house with a gable roof, light siding, and a screened-in porch, emphasizing simplicity and openness."}
{"file_name": "imgs/47_frontal.jpg", "text": "This single-story ranch-style home features a gabled roof, spacious lawn, screened porch, large windows, and a detached garage, offering a blend of comfort and country living."}
{"file_name": "imgs/512_frontal.jpg", "text": "The house showcases a Spanish Revival architectural style, characterized by stucco walls, arched doorways, wooden shutters, and a red-tiled roof."}
{"file_name": "imgs/512_frontal.jpg", "text": "This charming townhouse boasts a Mediterranean architectural style, featuring a two-story layout, arched doorway, and landscaped front yard with lush greenery, offering a cozy and inviting curb appeal."}
{"file_name": "imgs/512_frontal.jpg", "text": "This is a two-story house featuring a front archway entrance, a small front yard, and large windows. There are no visible balconies, terraces, or verandas."}
{"file_name": "imgs/512_frontal.jpg", "text": "The facade uses white stucco with brick accents and brown wooden shutters. Decorative arches and wooden support beams accentuate the design. Simple lighting fixtures are present near the entryways."}
{"file_name": "imgs/19_frontal.jpg", "text": "The facade features smooth beige stucco, wood door accents, and desert landscaping with decorative cacti. Subtle wall lighting highlights the clean lines and carved window details."}
{"file_name": "imgs/19_frontal.jpg", "text": "This single-story house features a modern design with large windows, a flat roof, and desert landscaping. Unique elements include tall cacti and decorative window placements."}
{"file_name": "imgs/19_frontal.jpg", "text": "Modern southwestern home with stucco walls, flat roof, and large wooden entrance. Features spacious rooms, desert landscaping, cacti accents, natural stone pathway, and minimalistic design elements."}
{"file_name": "imgs/19_frontal.jpg", "text": "The house exhibits a modern Southwestern architectural style, featuring smooth stucco walls, flat roofs and desert landscaping accentuated by prominent large cacti."}
{"file_name": "imgs/183_frontal.jpg", "text": "This single-story house features a quaint front porch with decorative railings and a gable roof, providing a welcoming entryway."}
{"file_name": "imgs/183_frontal.jpg", "text": "The facade features light blue and white colors, a scalloped trim, cross-braced railings, and a single hanging light fixture above the entrance."}
{"file_name": "imgs/183_frontal.jpg", "text": "The house features a charming, minimalist cottage style with a pastel color scheme, decorative lattice work, and a simple gable roof."}
{"file_name": "imgs/183_frontal.jpg", "text": "Charming cottage-style house with a pastel-blue gable roof, front porch with decorative railings, spacious yard, and quaint window trims, exuding a cozy vintage appeal."}
{"file_name": "imgs/255_frontal.jpg", "text": "Mediterranean style with stucco walls, arched doorways, clay tile roof, and large windows. Features multiple levels with outdoor seating and a central courtyard fountain."}
{"file_name": "imgs/255_frontal.jpg", "text": "Elegant Mediterranean-style home with arched windows, a stucco exterior, red-tiled roof, outdoor patio, fountain, and spiral staircase. Luxurious, sophisticated design and spacious outdoor lounging areas are standout features."}
{"file_name": "imgs/255_frontal.jpg", "text": "This two-story house features arched doorways, large vertical windows, a centrally placed fountain, an outdoor seating area, and an external staircase. It combines traditional and modern architectural elements."}
{"file_name": "imgs/255_frontal.jpg", "text": "The facade features beige stucco, white trim, and red shutters with terracotta roof tiles. Decorative arches, wrought iron lighting fixtures, and a tiered fountain enhance the exterior."}
{"file_name": "imgs/337_frontal.jpg", "text": "The house is a single-story structure featuring a front patio area, large windows, and an adjacent carport with an awning for outdoor coverage."}
{"file_name": "imgs/337_frontal.jpg", "text": "The facade features light grey horizontal siding, white-trimmed windows, and a flat roof. There are minimalistic decorative elements and a visible satellite dish, but no lighting fixtures are evident."}
{"file_name": "imgs/337_frontal.jpg", "text": "The house features mid-century modern architectural style with clean lines, flat roof, large windows, and a minimalist design aesthetic, complemented by a well-maintained lawn and desert landscaping."}
{"file_name": "imgs/337_frontal.jpg", "text": "This charming ranch-style home features a simple, single-story structure, expansive lawn, mature palm trees, and a cozy covered patio, set in a tranquil, well-maintained neighborhood."}
{"file_name": "imgs/69_frontal.jpg", "text": "The facade features beige siding, red brick, and red shutters, with white columns and trim. Decorative elements include lush greenery and a small light fixture near the entrance."}
{"file_name": "imgs/69_frontal.jpg", "text": "Two-story house with red brick and light-colored siding. Features include columns, a small front porch, and red shutters on windows."}
{"file_name": "imgs/69_frontal.jpg", "text": "Charming two-story Colonial-style home with brick and siding exterior, featuring a covered porch, red shutters, mature trees, and a landscaped yard with decorative rock beds for added curb appeal."}
{"file_name": "imgs/69_frontal.jpg", "text": "The house features a traditional suburban architectural style with brick and siding exterior, prominent columns, and red shutters."}
{"file_name": "imgs/225_frontal.jpg", "text": "This house features a single-story Ranch-style design, characterized by its low roofline, wide front, large windows, and an integrated garage."}
{"file_name": "imgs/225_frontal.jpg", "text": "Charming single-story ranch-style home with a modern layout, featuring a red door, spacious front yard, mature trees, manicured landscaping, and an attached two-car garage for convenience."}
{"file_name": "imgs/225_frontal.jpg", "text": "This single-story house features a simple layout with a front lawn, central walkway, and attached garage, characterized by a low-pitched roof and large windows."}
{"file_name": "imgs/225_frontal.jpg", "text": "The facade features light beige walls, a dark shingled roof, white window trims, a vibrant red door, and simple landscaping. No visible decorative elements or lighting fixtures."}
{"file_name": "imgs/347_frontal.jpg", "text": "Single-story house with a front porch covered by a pergola, accessible via steps. Gravel landscaping in the front yard, featuring a few small plants."}
{"file_name": "imgs/347_frontal.jpg", "text": "The exterior features light beige horizontal siding, a wooden pergola, a red front door, white trim, small bushes, gravel landscaping, and pathway lights enhancing the front walkway."}
{"file_name": "imgs/347_frontal.jpg", "text": "This house features a simple and utilitarian manufactured home design with a flat roof, minimalistic porch with pergola, and xeriscaped front yard for low maintenance."}
{"file_name": "imgs/347_frontal.jpg", "text": "This single-story, ranch-style home boasts a minimalist yard with desert landscaping, a welcoming pergola-covered entrance, and a charming brick pathway highlighting a serene, low-maintenance outdoor appeal."}
{"file_name": "imgs/94_frontal.jpg", "text": "The facade uses brown wood siding with horizontal and vertical patterns, a white garage door, and a covered porch. Minimalistic lighting and planted pots adorn the exterior."}
{"file_name": "imgs/94_frontal.jpg", "text": "Single-story house with a two-car garage, a covered front entrance, and a verandah. Rustic design with wood siding and expansive windows offering natural light."}
{"file_name": "imgs/94_frontal.jpg", "text": "Charming rustic home with a split-level design, attached two-car garage, expansive porch, and scenic mountain views. Unique outdoor features include a large garden and abundant natural light."}
{"file_name": "imgs/94_frontal.jpg", "text": "The house exhibits a contemporary ranch-style architecture with a simplistic, single-story design, prominent overhanging eaves, and a functional, unadorned exterior."}
{"file_name": "imgs/442_frontal.jpg", "text": "The facade features beige stucco, a shingled roof, arched entryways, white-framed windows, and a white garage door. Decorative elements include a small lantern-style light fixture and brick accents."}
{"file_name": "imgs/442_frontal.jpg", "text": "Single-story house featuring a large garage, arched front porch, and a traditional exterior design."}
{"file_name": "imgs/442_frontal.jpg", "text": "Single-story ranch-style home featuring arched front porch, spacious front yard, two-car garage, and mature trees. Simple yet charming design with stucco exterior and tiled roof."}
{"file_name": "imgs/442_frontal.jpg", "text": "Single-story ranch-style house with arched entryways, stucco exterior, and a double garage."}
{"file_name": "imgs/112_frontal.jpg", "text": "Single-story house with a spacious layout, four-car garage, and well-kept landscaping. Notable elements include a tiled roof and front windows, adding elegant architectural charm."}
{"file_name": "imgs/112_frontal.jpg", "text": "The facade features light grey stucco, white garage doors with decorative windows, tiled roof, warm wall-mounted lantern lights, and lush green landscaping."}
{"file_name": "imgs/112_frontal.jpg", "text": "The house features a contemporary suburban ranch style with a hipped roof, clean lines, stucco exterior, multi-car garage, and manicured landscaping."}
{"file_name": "imgs/112_frontal.jpg", "text": "This Mediterranean-style home features a four-car garage, lush landscaping, large windows, and open layout. Unique tiled roof and expansive driveway complete this elegant, sophisticated property."}
{"file_name": "imgs/88_frontal.jpg", "text": "The facade features beige stucco, dark stone accents, and gray tile roofing. Warm yellow lighting fixtures provide a cozy ambiance, highlighting the elegant yet understated exterior design."}
{"file_name": "imgs/88_frontal.jpg", "text": "Single-story house with a courtyard entryway, tiled roofing, stone accents, and a large glass window providing views. Features an attached two-car garage."}
{"file_name": "imgs/88_frontal.jpg", "text": "This modern Mediterranean home features a U-shaped layout, stone accents, and a three-car garage. Its expansive windows offer stunning mountain views, blending luxury with nature's beauty."}
{"file_name": "imgs/88_frontal.jpg", "text": "The house features modern ranch-style architecture with a low-pitched roof, stucco exterior, stone accents, large windows, and an open entry courtyard."}
{"file_name": "imgs/239_frontal.jpg", "text": "The house features a modern suburban style with a stucco exterior, large windows, and a gabled roof, complemented by a two-car garage and manicured landscaping."}
{"file_name": "imgs/239_frontal.jpg", "text": "This modern, two-story home features a spacious layout, a charming gabled roof, lush landscaping, a two-car garage, and a well-maintained driveway, offering a welcoming curb appeal."}
{"file_name": "imgs/239_frontal.jpg", "text": "This two-story house features a gable roof, a double garage, several front windows, and a modest front garden with palm trees. Unique elements include a prominent balcony on the upper level."}
{"file_name": "imgs/239_frontal.jpg", "text": "The facade features beige stucco, tan vertical siding panels, white trim, and a tan garage door. Decorative lighting fixtures flank the garage."}
{"file_name": "imgs/520_frontal.jpg", "text": "This modern Mediterranean-style home features a three-car garage, arched entry, manicured lawn, and tiled roof. Its inviting facade and functional layout blend charm and practicality."}
{"file_name": "imgs/520_frontal.jpg", "text": "The house features a Mediterranean Revival architectural style with stucco walls, a red-tiled roof, arched entryway, and large, symmetrically placed windows. Simple landscaping complements the look."}
{"file_name": "imgs/520_frontal.jpg", "text": "The facade features stucco in a muted gray tone, complemented by a red tile roof and dark brown garage doors. Decorative elements include arched windows and doors, with flagpole lighting."}
{"file_name": "imgs/520_frontal.jpg", "text": "Single-story house with a tiled roof, three-car garage, and an arched entryway. No visible balconies or terraces."}
{"file_name": "imgs/75_frontal.jpg", "text": "The exterior features light gray siding, light brick accents, and a neutral shingle roof. A porch with dark wood railings, decorative gable vents, and minimalistic landscape accentuate the facade."}
{"file_name": "imgs/75_frontal.jpg", "text": "This two-story house features a front porch veranda, a two-car garage, and large windows. The layout includes a welcoming entrance and well manicured lawn."}
{"file_name": "imgs/75_frontal.jpg", "text": "Two-story, traditional-style home featuring a gable roof, attached two-car garage, covered front porch, manicured lawn, and distinctive arched window."}
{"file_name": "imgs/75_frontal.jpg", "text": "The house features a modern suburban architectural style with symmetrical windows, vinyl siding, a gable roof, a front porch, and an attached two-car garage."}
{"file_name": "imgs/432_frontal.jpg", "text": "The facade features beige stucco with tan siding, brown roof shingles, and a white garage door. Decorative elements include stone accents and potted plants, with minimal exterior lighting fixtures."}
{"file_name": "imgs/432_frontal.jpg", "text": "This two-story house features a gabled roof, a two-car garage, and a front entry with a small porch. Distinctive elements include dormer windows and a textured exterior."}
{"file_name": "imgs/432_frontal.jpg", "text": "This charming Tudor-style home features a gabled roof, spacious two-car garage, a serpentine driveway, mature landscaping, and unique stone accents, set amid serene natural surroundings."}
{"file_name": "imgs/432_frontal.jpg", "text": "This house has a traditional American suburban style with a steeply pitched roof, gable front, and combined stucco and stone exterior."}
{"file_name": "imgs/162_frontal.jpg", "text": "Single-story house with attached garage, front steps leading to the entrance, large front windows, and a simple, traditional facade."}
{"file_name": "imgs/162_frontal.jpg", "text": "The facade features beige siding with red trim, a gray shingle roof, lattice decorative element, and a simple black wall-mounted light fixture. Large windows enhance the inviting look."}
{"file_name": "imgs/162_frontal.jpg", "text": "A single-story ranch-style house featuring a low-pitched roof, horizontal lines, a modest front yard, and an attached two-car garage."}
{"file_name": "imgs/162_frontal.jpg", "text": "Charming Ranch-style home with clean lines, featuring a spacious garage, well-manicured lawn, mature trees, and a welcoming front porch, ideal for comfortable living and outdoor enjoyment."}
{"file_name": "imgs/249_frontal.jpg", "text": "This house features a Mediterranean-inspired architecture with stucco walls, a red-tiled roof, arched windows, and minimalistic decor."}
{"file_name": "imgs/249_frontal.jpg", "text": "This Mediterranean-style home features a two-story layout, arched doorways, and a tiled roof. It has a spacious driveway, manicured lawn, and lush garden, enhancing its charming curb appeal."}
{"file_name": "imgs/249_frontal.jpg", "text": "This is a two-story house featuring a tiled roof, a double garage, a prominent balcony above the entrance, and lush landscaping."}
{"file_name": "imgs/249_frontal.jpg", "text": "White stucco facade with brown trim, red-tiled roof, decorative arches, and brown garage door. Features include a coach lantern-style light fixture and neatly landscaped front yard."}
{"file_name": "imgs/491_frontal.jpg", "text": "Single-story house, attached garage, and front yard with desert landscaping. Features a side gate, large driveway, and low-pitched roof."}
{"file_name": "imgs/491_frontal.jpg", "text": "Cream facade with green trim, stucco texture. Decorative garage door windows. Yellow lantern-style lighting fixtures flanking garage. Minimalist landscaping with gravel and stones."}
{"file_name": "imgs/491_frontal.jpg", "text": "Single-story, mid-century modern house featuring a low-pitched roof, overhanging eaves, wide garage, and clean lines with minimal ornamentation."}
{"file_name": "imgs/491_frontal.jpg", "text": "Single-story ranch-style home with a two-car garage, arched windows, drought-tolerant landscaping, and a spacious driveway. Notable for its serene environment and low-maintenance yard."}
