{"file_name": "imgs/259_frontal.jpg", "text": "This two-story house features a three-car garage, a covered front porch, and a well-maintained lawn, creating an inviting exterior."}
{"file_name": "imgs/259_frontal.jpg", "text": "The facade features beige stucco with white trim, stone accent pillars, and a reddish-brown shingle roof; includes light fixtures by the garage and front door."}
{"file_name": "imgs/259_frontal.jpg", "text": "This house features a contemporary suburban architectural style with a stucco exterior, gabled roofs, and a mix of stone accents on the front porch columns."}
{"file_name": "imgs/259_frontal.jpg", "text": "Modern two-story home with a charming porch, spacious dual garages, stucco exterior, tiled roof, and manicured lawn. Highlights include layered roofline, prominent eaves, and inviting outdoor veranda."}
{"file_name": "imgs/15_frontal.jpg", "text": "Southwestern-style home with brick facade, pitched roof, and arched entry. Features xeriscaped garden, American flagpole, and ambient night lighting, creating a serene desert oasis."}
{"file_name": "imgs/15_frontal.jpg", "text": "The house showcases a blend of Southwestern and contemporary style, featuring stucco walls, arched windows, a tile roof, and desert landscaping."}
{"file_name": "imgs/15_frontal.jpg", "text": "The facade features varied brickwork, earthy beige tones, and smooth textures. Decorative arched windows, illuminated landscaping, and a prominent flagpole add charm and detail."}
{"file_name": "imgs/15_frontal.jpg", "text": "A single-story house with a partial stone facade, a prominent entryway, and a landscaped front yard featuring a U.S. flagpole and various desert plants."}
{"file_name": "imgs/172_frontal.jpg", "text": "Single-story ranch-style home with a mix of brick and wood siding, featuring a sloped roof, large windows, and a landscaped garden."}
{"file_name": "imgs/172_frontal.jpg", "text": "This charming ranch-style home features a brick facade, spacious layout, landscaped garden, multi-tiered entry, and a concrete driveway, exuding classic appeal and modern comfort."}
{"file_name": "imgs/172_frontal.jpg", "text": "Single-story house with brick facade, featuring a covered porch and landscaped garden area, leading to an entryway with multiple front steps."}
{"file_name": "imgs/172_frontal.jpg", "text": "The facade features red and white brick, beige vertical siding, dark green trim, and a tiled roof. Decorative plants and potted flowers adorn the brick staircase entry."}
{"file_name": "imgs/422_frontal.jpg", "text": "Charming ranch-style home with a spacious layout, featuring a three-car garage, manicured lawn, mountain views, and a welcoming porch, offering serene outdoor living and unique character."}
{"file_name": "imgs/422_frontal.jpg", "text": "The house showcases a modern suburban architectural style with its clean lines, gable roof, attached garage, and neat landscaping, blending contemporary and traditional elements."}
{"file_name": "imgs/422_frontal.jpg", "text": "The facade features white siding, gray roof tiles, stone accents, and a covered porch. Subtle decorative elements include window shutters and external lighting fixtures by the entrance."}
{"file_name": "imgs/422_frontal.jpg", "text": "This single-story home features a multi-car garage, a covered front porch, and a well-manicured lawn, all set against a scenic mountainous backdrop."}
{"file_name": "imgs/229_frontal.jpg", "text": "The house features two stories, an attached garage, a covered entry porch, and well-manicured landscaping with stairs leading to the front door."}
{"file_name": "imgs/229_frontal.jpg", "text": "The facade features beige stucco, brown shutters, stone accents, and beige trim. Decorative elements include a wreath and exterior wall light fixtures."}
{"file_name": "imgs/229_frontal.jpg", "text": "The house combines elements of Craftsman and Contemporary styles, featuring stucco walls, shutters, a symmetrical facade, multi-gable rooflines, and stone accents."}
{"file_name": "imgs/229_frontal.jpg", "text": "Charming two-story Craftsman home with gable roofs, stone accents, spacious lawn, welcoming front porch, and brick-paver steps. Features open-plan design and elegant shutters, blending comfort with curb appeal."}
{"file_name": "imgs/65_frontal.jpg", "text": "This two-story brick home features a gabled roof, triple garage, large arched windows, manicured lawn, and mature trees, exemplifying classic American suburban architecture with elegant, roomy, light-filled interiors."}
{"file_name": "imgs/65_frontal.jpg", "text": "The house is designed in a modern suburban style with a brick exterior, multi-gabled roof, large windows, and an attached three-car garage."}
{"file_name": "imgs/65_frontal.jpg", "text": "The house exterior features red brick with gray roof shingles, white window trim, an arched window pattern, and matching white garage doors. Decorative lighting fixtures flank the entrance."}
{"file_name": "imgs/65_frontal.jpg", "text": "This two-story brick house features large arched windows, a three-car garage, and a prominent front door, with an attractive gable roof design and well-maintained landscaping."}
{"file_name": "imgs/530_frontal.jpg", "text": "Stucco facade in neutral tan, white trim, and brown shutters. Tiled roof, small decorative vents, two hanging lantern-style fixtures, greenery accents at base."}
{"file_name": "imgs/530_frontal.jpg", "text": "A single-story house featuring a gabled roof, decorative shutters, and a two-car garage. It includes a small garden area, and a driveway. The exterior is stuccoed."}
{"file_name": "imgs/530_frontal.jpg", "text": "Charming ranch-style home with stucco exterior, two-car garage, well-manicured lawn, tiled roof, and elegant landscaping. Unique blend of suburban tranquility and modern amenities."}
{"file_name": "imgs/530_frontal.jpg", "text": "The house features a California Ranch style characterized by stucco walls, gable roofs with exposed beams, large garage door, and an open, single-story layout."}
{"file_name": "imgs/98_frontal.jpg", "text": "A charming multi-story home featuring suburban architectural style, spacious layout, manicured landscaping, and a distinctively inviting exterior with large windows and a tiled roof."}
{"file_name": "imgs/98_frontal.jpg", "text": "The house features a contemporary suburban architectural style with a gabled roof, large windows, and light-colored siding, exuding a clean and modern aesthetic."}
{"file_name": "imgs/98_frontal.jpg", "text": "The facade features light gray horizontal siding, terracotta roof tiles, white trim, a central pillar, a paneled garage door, large windows, minimal decor, and a single sconce light fixture."}
{"file_name": "imgs/98_frontal.jpg", "text": "This is a two-story house with a tiled roof, prominent front gable, large windows, and an attached garage, featuring a clean, charming exterior."}
{"file_name": "imgs/102_frontal.jpg", "text": "The house features a Mediterranean architectural style, characterized by white stucco walls, red-tiled roofs, and a spacious terrace with balustrades."}
{"file_name": "imgs/102_frontal.jpg", "text": "This elegant hillside home features Mediterranean architectural style, multi-level layout, expansive balconies, panoramic views, spacious driveway, and unique stone landscaping for a luxurious and serene retreat."}
{"file_name": "imgs/102_frontal.jpg", "text": "A two-story house featuring a prominent garage, multiple terraces, and defined balconies, enhancing its architectural appeal and exterior functionality."}
{"file_name": "imgs/102_frontal.jpg", "text": "The facade features white stucco walls, red tile roofing, and beige decorative balustrades. There are exterior sconces and patterned railings enhancing the visual appeal."}
{"file_name": "imgs/452_frontal.jpg", "text": "Charming single-story ranch-style home with a tiled roof, manicured hedges, gated front yard, and scenic mountain backdrop, offering serene natural views and privacy."}
{"file_name": "imgs/452_frontal.jpg", "text": "Single-story, ranch-style home with a gable roof, minimalist design, and a manicured front yard."}
{"file_name": "imgs/452_frontal.jpg", "text": "The facade features light-colored walls, a grey-tiled roof, and minimalistic metal fencing. Decorative elements include neatly trimmed bushes, but no visible lighting fixtures or elaborate patterns."}
{"file_name": "imgs/452_frontal.jpg", "text": "The house is single-story with a tiled roof. It features a front yard with landscaped shrubs and a boundary fence for privacy. There are no visible balconies or terraces."}
